In [10]:
import os
import pandas as pd

In [4]:
os.listdir('./machine_learning_data')

['wc_result.png',
 'dolphine.jpg',
 'new_friend.csv',
 'crawlings__210510.log',
 'Naver_opinion.txt',
 'test_csv.txt',
 'friend.csv',
 'NanumBarunGothic.ttf',
 '.ipynb_checkpoints',
 'train_data.csv',
 'abalone.data',
 'wc_result1.png',
 'new_friend_index_true.csv']

In [8]:
# 데이터 폴더 scr 변수 할당
base_src = "./machine_learning_data"

# friend.csv 파일 src 변수 할당
friend_src = base_src + '/friend.csv'

In [11]:
# pandas의 read_csv => 데이터 불러오기
df = pd.read_csv(friend_src, encoding='utf-8')

In [12]:
# head() 데이터를 읽어보기
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [14]:
pd.Series(
    [1, 2, 3]
)

0    1
1    2
2    3
dtype: int64

In [ ]:
# Series 실습
import numpy as np
np.array(
    [1, 2, 3]
)

array([1, 2, 3])

In [ ]:
# 데이터프레임(집합) => 시리즈 (단일) => 데이터프레임
series = df['name']
series

0     John
1    Jenny
2     Nate
3    Julia
4    Brian
5    Chris
Name: name, dtype: object

In [18]:
# pd.Series 함수를 통해서 만드는 것도 가능
series = pd.Series([1, 2, 3, 4])
series

0    1
1    2
2    3
3    4
dtype: int64

In [20]:
df = pd.DataFrame(
    {
        'a': [2, 3],
        'b': [5, 10]
    }
)
df

   a   b
0  2   5
1  3  10

In [23]:

df = pd.DataFrame(
    [
        [2, 5],
        [3, 10],
        [10, 20],
    ],
    columns=['a', 'b']
)
df

    a   b
0   2   5
1   3  10
2  10  20

In [26]:
df = pd.DataFrame(
    [
        [2, 5, 100],
        [3, 10, 200],
        [10, 20, 300],
    ],
    columns = ['a', 'b', 'c'],
    index = ['가', '나', '다'],
    dtype=float
)
df

      a     b      c
가   2.0   5.0  100.0
나   3.0  10.0  200.0
다  10.0  20.0  300.0

In [27]:
df = pd.read_csv(friend_src, encoding='utf-8')
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [29]:
# index 2번에 해당하는 row가져오기
df.iloc[4]

name      Brian
age          45
job     manager
Name: 4, dtype: object

In [36]:
df.iloc[1, 2] # Select * from friend where pk=2

'developer'

In [31]:
df['job']

0      student
1    developer
2      teacher
3      dentist
4      manager
5       intern
Name: job, dtype: object

In [35]:
df.loc[1, 'job']

'developer'